RIET/src/DataProcessors/UploadBPNSPNMappingData/UploadBPNSPNMappingData.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>UploadBPNSPNMappingData</name>
  <attributes>
    <name>ПутьФайл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВоВременномХранилище</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаКлиенте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаблицаОшибок</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

RIET/src/DataProcessors/UploadBPNSPNMappingData/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПутьДокументыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыборФайла();
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайла()
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	//Диалог.Каталог = Элемент.Значение;
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "XLS (*.xlsx)|*.xlsx|*.xls";
	Диалог.Заголовок = "Выберите файл...";
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	Если Диалог.ВыбранныеФайлы.Количество()<>0 Тогда
		ПутьФайла = Диалог.ВыбранныеФайлы[0];
		Объект.ПутьФайл = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	ЗагрузитьДанные();
	
КонецПроцедуры


&НаСервере
Процедура ВызовПроцедурыОбработки()
	
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	ОбъектОбработка.ЗагрузитьТаблицу();
	//ЗагрузитьТаблицуВ2
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТабДокСообщений()	
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	ТабДок = ОбъектОбработка.СформироватьТабДокСообщений();
	Возврат ТабДок;
КонецФункции


&НаКлиенте
Процедура ЗагрузитьДанные() Экспорт
	Объект.НаКлиенте = Истина;
	ВыбранноеИмяФайла = Объект.ПутьФайл;
	Файл = Новый Файл(ВыбранноеИмяФайла);
	Если Не Файл.Существует() Тогда
		
		ТекстСообщения = Нстр("ru = 'Указанный файл не существует'");
		ПутьКДанным = ?(Объект.НаКлиенте, "", "ИмяФайлаЗагрузки");
		СообщитьПользователю(ТекстСообщения, ПутьКДанным);
		Возврат;
		
	КонецЕсли;
	
	Если Объект.НаКлиенте Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьДанныеЗавершение", ЭтаФорма);
		НачатьПомещениеФайла(ОписаниеОповещения,Объект.ВоВременномХранилище,Объект.ПутьФайл,Ложь,ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
		
	ВызовПроцедурыОбработки();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеЗавершение(Результат, Адрес, ВыбранноеИмяФайла,ДополнительныеПараметры)
	Объект.ВоВременномХранилище = Адрес;	
КонецПроцедуры
	
&НаКлиентеНаСервереБезКонтекста
Процедура СообщитьПользователю(Текст, ПутьКДанным = "")
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.ПутьКДанным = ПутьКДанным;
	Сообщение.Сообщить();
	
КонецПроцедуры
